app/controllers/microposts_controller.rb

SELECT * FROM "microposts"
---
  def index
    @microposts = Micropost.all

SELECT * FROM "microposts" WHERE ("microposts"."id" = 1)
---
  def show
    @micropost = Micropost.find(params[:id])

SELECT * FROM "microposts" WHERE ("microposts"."id" = 1)
---
  def edit
    @micropost = Micropost.find(params[:id])

INSERT INTO "microposts" ("created_at", "updated_at", "user_id", "content") VALUES('2010-06-08 00:19:09', '2010-06-08 00:19:09', 1, 'This notes only have one hundred characters and it will be invalidated if it goes over it.')
---
  def create
    @micropost = Micropost.new(params[:micropost])

    respond_to do |format|
      if @micropost.save

SELECT * FROM "microposts" WHERE ("microposts"."id" = 1)
UPDATE "microposts" SET "updated_at" = '2010-06-08 00:19:59', "content" = 'This notes and paragraphs will be passed over only have one hundred characters and it will be invalidated if it goes over it.' WHERE "id" = 1
---
  def update
    @micropost = Micropost.find(params[:id])

    respond_to do |format|
      if @micropost.update_attributes(params[:micropost])

SELECT * FROM "microposts" WHERE ("microposts"."id" = 1)
DELETE FROM "microposts" WHERE "id" = 1
---
  def destroy
    @micropost = Micropost.find(params[:id])
    @micropost.destroy