app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at", "email") VALUES('Erumy Vega', '2010-06-07 23:56:06', '2010-06-07 23:56:06', 'guest@example.com')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 5)
UPDATE "users" SET "updated_at" = '2010-06-08 00:15:31', "name" = 'This paragraph only can havejjkkdkkkdkkkdkkkdkkkdkkd one hundred characters, if not it will be invalidates' WHERE "id" = 5